tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "johanhaleby/kubetail"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Python code formatter
brew "black"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Lint your Python code for style and logical errors
brew "flake8"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Kubernetes package manager
brew "helm"
# Istio configuration command-line utility
brew "istioctl"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Simple terminal UI for git commands
brew "lazygit"
# DNS library written in C
brew "ldns"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Text-to-HTML conversion tool
brew "markdown"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML documents from the CLI
brew "yq"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# GPU-based terminal emulator
cask "kitty"
