tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "johanhaleby/kubetail"
tap "pgi/cask", "ssh://git@bitbucket.pgi-tools.com/dt/homebrew-cask.git"
tap "universal-ctags/universal-ctags"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-line Golang template processor
brew "gomplate"
# Colorize logfiles and command output
brew "grc"
# The Kubernetes package manager
brew "helm"
# Command-line editor
brew "id3v2"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Package manager for kubectl plugins
brew "krew"
# Kubernetes Native Serverless Framework
brew "kubeless"
# The lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# Package manager for the Lua programming language
brew "luarocks"
# Extremely Fast Compression algorithm
brew "lz4"
# Real-time data compression library
brew "lzo"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Paragraph reflow for email
brew "par"
# Parchive: Parity Archive Volume Set for data recovery
brew "par2"
# Library to simplify the interaction with PKCS#11
brew "pkcs11-helper"
# Object-relational database system
brew "postgresql"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Database of common MIME types
brew "shared-mime-info"
# SOcket CAT: netcat on steroids
brew "socat"
# The cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Extract, view, and test RAR archives
brew "unrar"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "font-meslolg-nerd-font"
cask "kitty"
cask "stim"
cask "transmission"
mas "1Blocker", id: 1107421413
mas "Boom 2", id: 948176063
mas "DaisyDisk", id: 411643860
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Silicio", id: 933627574
mas "Slack", id: 803453959
mas "Soulver", id: 413965349
mas "The Unarchiver", id: 425424353
mas "Ulysses", id: 1225570693
mas "Valentina Studio", id: 604825918
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650
